Autodesk.Revit.DB.FabricationRodInfo.GetRodLength(System.Int32)
Get the current rod length. If the rod is the length will include structural extension.
rodIndex:
The rod index.
Returns:
Returns rod length of hanger for specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.SetRodLength(System.Int32,System.Double)
Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted.
rodIndex:
The rod index.
Returns:
Returns true if it was successful otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rod length cannot be set because the hanger is set to automatically host to other elements.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.GetRodStructureExtension(System.Int32)
Gets the length of the rod's top extension into structure.
rodIndex:
The rod index.
Returns:
Returns the extension length that will be applied if the rod is attached to structure.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.SetRodStructureExtension(System.Int32,System.Double)
Set the length of the rod's top extension into structure. The rod must be attached to structure.
rodIndex:
The rod index.
extension:
Distance the rod will extend into the structure.
Returns:
Returns true if it was successful otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rods do not attached to any structue.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.AttachToHanger(Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.XYZ)
Attaches the hanger rod to another bearer hanger.
hangerId:
Identifier of the bearer hanger to which the rod attaches.
rodIndex:
The index of the rod.
position:
The position of the rod end. It should be on bearer centerline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The hanger is not a bearer hanger.
-or-
The point is not on hanger bearer centerline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.SetRodEndPosition(System.Int32,Autodesk.Revit.DB.XYZ)
Sets the position of the rod end. The method is applicable only for bearer hanger.
rodIndex:
The index of the rod.
position:
The position of the rod end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid rod position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The hanger is not a bearer hanger.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.GetRodAttachedElementId(System.Int32)
Gets the identifier of the attached component for the specified rod.
rodIndex:
The index of the specified rod.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rods do not attached to any structue.
Since:
2016